/* 
Вывести на экран числа от 1 до 10 включительно, используя цикл while. Каждое значение с новой строки.
*/

public class Solution {
    public static void main(String[] args) {
        
        int i = 1;
        
        while (i < 11){
            System.out.println(i);
            i++;
        }
    }
}
