import java.io.BufferedReader;
import java.io.InputStreamReader;

/* 
Ввести с клавиатуры строку и число N больше 0.
Вывести на экран строку N раз используя цикл while. Каждое значение с новой строки.
*/

public class Solution {
    public static void main(String[] args) throws Exception {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        
        String st = reader.readLine();
        int num = Integer.parseInt(reader.readLine());
                
        while (num > 0)
        {
            System.out.println(st);
            num--;
        }

    }
}
